11/data/attachments/f1abed4525898afa.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_5e988d66-c39f-4d93-a2ee-289563e171dc</nif:username>
            <nif:friendToBeAdded>Corey_husband_Friend_2526_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>